#*********************************************************************************************************
#
#                                 北京翼辉信息技术有限公司
#
#                                   微型安全实时操作系统
#
#                                       MS-RTOS(TM)
#
#                               Copyright All Rights Reserved
#
#--------------文件信息--------------------------------------------------------------------------------
#
# 文   件   名: libjpeg.mk
#
# 创   建   人: IoT Studio
#
# 文件创建日期: 2020 年 01 月 04 日
#
# 描        述: 本文件由 IoT Studio 生成，用于配置 Makefile 功能，请勿手动修改
#*********************************************************************************************************

#*********************************************************************************************************
# Clear setting
#*********************************************************************************************************
include $(CLEAR_VARS_MK)

#*********************************************************************************************************
# Target
#*********************************************************************************************************
LOCAL_TARGET_NAME := libjpeg.a

#*********************************************************************************************************
# Source list
#*********************************************************************************************************
LOCAL_SRCS := \
src/jpeg/cjpeg.c \
src/jpeg/rdppm.c \
src/jpeg/rdgif.c \
src/jpeg/rdtarga.c \
src/jpeg/rdrle.c \
src/jpeg/rdbmp.c \
src/jpeg/rdswitch.c \
src/jpeg/cdjpeg.c \
src/jpeg/jaricom.c \
src/jpeg/jcapimin.c \
src/jpeg/jcapistd.c \
src/jpeg/jcarith.c \
src/jpeg/jccoefct.c \
src/jpeg/jccolor.c \
src/jpeg/jcdctmgr.c \
src/jpeg/jchuff.c \
src/jpeg/jcinit.c \
src/jpeg/jcmainct.c \
src/jpeg/jcmarker.c \
src/jpeg/jcmaster.c \
src/jpeg/jcomapi.c \
src/jpeg/jcparam.c \
src/jpeg/jcprepct.c \
src/jpeg/jcsample.c \
src/jpeg/jctrans.c \
src/jpeg/jdapimin.c \
src/jpeg/jdapistd.c \
src/jpeg/jdarith.c \
src/jpeg/jdatadst.c \
src/jpeg/jdatasrc.c \
src/jpeg/jdcoefct.c \
src/jpeg/jdcolor.c \
src/jpeg/jddctmgr.c \
src/jpeg/jdhuff.c \
src/jpeg/jdinput.c \
src/jpeg/jdmainct.c \
src/jpeg/jdmarker.c \
src/jpeg/jdmaster.c \
src/jpeg/jdmerge.c \
src/jpeg/jdpostct.c \
src/jpeg/jdsample.c \
src/jpeg/jdtrans.c \
src/jpeg/jerror.c \
src/jpeg/jfdctflt.c \
src/jpeg/jfdctfst.c \
src/jpeg/jfdctint.c \
src/jpeg/jidctflt.c \
src/jpeg/jidctfst.c \
src/jpeg/jidctint.c \
src/jpeg/jquant1.c \
src/jpeg/jquant2.c \
src/jpeg/jutils.c \
src/jpeg/jmemmgr.c \
src/jpeg/jmemnobs.c

#*********************************************************************************************************
# Header file search path (eg. LOCAL_INC_PATH := -I"Your header files search path")
#*********************************************************************************************************
LOCAL_INC_PATH :=

#*********************************************************************************************************
# Pre-defined macro (eg. -DYOUR_MARCO=1)
#*********************************************************************************************************
LOCAL_DSYMBOL := 

#*********************************************************************************************************
# Compiler flags
#*********************************************************************************************************
LOCAL_CFLAGS   := 
LOCAL_CXXFLAGS := 

#*********************************************************************************************************
# Depend library (eg. LOCAL_DEPEND_LIB := -la LOCAL_DEPEND_LIB_PATH := -L"Your library search path")
#*********************************************************************************************************
LOCAL_DEPEND_LIB      := 
LOCAL_DEPEND_LIB_PATH := 

#*********************************************************************************************************
# C++ config
#*********************************************************************************************************
LOCAL_USE_CXX        := no
LOCAL_USE_CXX_EXCEPT := no

#*********************************************************************************************************
# Code coverage config
#*********************************************************************************************************
LOCAL_USE_GCOV := no

#*********************************************************************************************************
# Stack check config
#*********************************************************************************************************
LOCAL_USE_STACK_CHECK := no

#*********************************************************************************************************
# User link command
#*********************************************************************************************************
LOCAL_PRE_LINK_CMD   := 
LOCAL_POST_LINK_CMD  := 
LOCAL_PRE_STRIP_CMD  := 
LOCAL_POST_STRIP_CMD := 

#*********************************************************************************************************
# Depend target
#*********************************************************************************************************
LOCAL_DEPEND_TARGET := 

include $(STATIC_LIBRARY_MK)

#*********************************************************************************************************
# End
#*********************************************************************************************************
